Repository: GabrielVictor159/GVPB.Identity
Catalog: src/GVPB.Identity.Api/Resources/SharedResources.*.resx
Languages: es, pt

# IDLOG
source: Id is required.
es: El Id es obligatorio.
pt: O Id é obrigatório.

# LOGMESSAGE
source: Message is required.
es: El mensaje es obligatorio.
pt: A mensagem é obrigatória.

# LOGTYPE
source: Type is required.
es: El tipo es obligatorio.
pt: O tipo é obrigatório.

# LOGDATE
source: LogDate is required.
es: La fecha de registro es obligatoria.
pt: A data de registro é obrigatória.

# IDUSER
source: Id is required.
es: El Id es obligatorio.
pt: Id é obrigatório.

# IDREQUESTUSER
source: Id is required.
es: El Id es obligatorio.
pt: Id é obrigatório.

# CREATIONDATEREQUESTUSER
source: CreationDate is required.
es: La fecha de creación es obligatoria.
pt: A data de criação é obrigatória.

# BODYREQUESTUSER
source: The Body address is not valid.
es: La dirección del cuerpo no es válida.
pt: O corpo do endereço não é válido.

# USEREMAILNOTDEFINID
source: The email address is not valid.
es: La dirección de correo electrónico no es válida.
pt: O endereço de e-mail não é válido.

# USEREMAILEMPTY
source: The email address is required.
es: La dirección de correo electrónico es obligatoria.
pt: O endereço de e-mail é obrigatório.

# USERNAMELENGTH
source: Username must be at least 5 characters long.
es: El nombre de usuario debe tener al menos 5 caracteres de longitud.
pt: O nome de usuário deve ter pelo menos 5 caracteres de comprimento.

# USERNAMEEMPTY
source: Username is required.
es: El nombre de usuario es obligatorio.
pt: O nome de usuário é obrigatório.

# USERPASSWORD
source: Password length must be greater than 5 characters.
es: La contraseña debe tener más de 5 caracteres.
pt: A senha deve ter mais de 5 caracteres.

# USERRULE
source: Rule is required.
es: La regla es obligatoria.
pt: A regra é obrigatória.

# CONFIRMUSER_NOTFOUND
source: Unable to find the specified request
es: No se puede encontrar la solicitud especificada

# CONFIRM_USER_EMAIL_EXISTIS
source: There is already a user with this email
es: Ya existe un usuario con este correo electrónico

# LOGINNOTFOUND
source: Unable to find any user with the provided data.
es: No pudimos encontrar ningún usuario con los datos proporcionados.
pt: Não foi possível encontrar nenhum usuário com os dados fornecidos.

# RecoverPasswordUserNotFound
source: Unable to find user
es: No se puede encontrar el usuario

# RecoverPassword_EmailSubject
source: Recover Password
es: Recuperar contraseña

# REQUESTUSER_EMAILSUBJECT
source: User Confirmation
es: Confirmación de usuario

# REQUESTUSER_VERIFYPROPERTY
source: There is already a user in the database with
es: Ya existe un usuario en la base de datos con

# UPDATEUSER_NOTFOUND
source: User Not Found.
es: Usuario no encontrado.

# SUCESS_CONFIRMUSER
source: User Created Successfully
es: Usuario creado exitosamente

# SUCESS_REQUESTUSER
source: Solicitud de creación de usuario creada, por favor revise su correo electrónico y confirme la creación de usuario.
es: User creation request created, please check your email and confirm the user creation.
